const sex = {
  '男': '1',
  '女': '2'
};
const station = {
  '实习生': '0',
  '普通职工': '1',
  '助理': '2',
  '主管': '3',
  '经理': '4',
  '总监': '5',
  '合伙人': '98',
  '董事长': '99'
};
const nation = {
  '汉族': '汉族',
  '壮族': '壮族',
  '满族': '满族',
  '回族': '回族',
  '苗族': '苗族',
  '维吾尔族': '维吾尔族',
  '土家族': '土家族',
  '彝族': '彝族',
  '蒙古族': '蒙古族',
  '藏族': '藏族',
  '布依族': '布依族',
  '侗族': '侗族',
  '瑶族': '瑶族',
  '朝鲜族': '朝鲜族',
  '白族': '白族',
  '哈尼族': '哈尼族',
  '哈萨克族': '哈萨克族',
  '黎族': '黎族',
  '傣族': '傣族',
  '畲族': '畲族',
  '傈僳族': '傈僳族',
  '仡佬族': '仡佬族',
  '东乡族': '东乡族',
  '高山族': '高山族',
  '拉祜族': '拉祜族',
  '水族': '水族',
  '佤族': '佤族',
  '纳西族': '纳西族',
  '羌族': '羌族',
  '土族': '土族',
  '仫佬族': '仫佬族',
  '锡伯族': '锡伯族',
  '柯尔克孜族': '柯尔克孜族',
  '达斡尔族': '达斡尔族',
  '景颇族': '景颇族',
  '毛南族': '毛南族',
  '撒拉族': '撒拉族',
  '布朗族': '布朗族',
  '塔吉克族': '塔吉克族',
  '阿昌族': '阿昌族',
  '普米族': '普米族',
  '鄂温克族': '鄂温克族',
  '怒族': '怒族',
  '京族': '京族',
  '基诺族': '基诺族',
  '德昂族': '德昂族',
  '保安族': '保安族',
  '俄罗斯族': '俄罗斯族',
  '裕固族': '裕固族',
  '乌兹别克族': '乌兹别克族',
  '门巴族': '门巴族',
  '鄂伦春族': '鄂伦春族',
  '独龙族': '独龙族',
  '塔塔尔族': '塔塔尔族',
  '赫哲族': '赫哲族',
  '珞巴族': '珞巴族',
};
const label = {
  '精品': 1,
  '置顶': 2
};

const boolean = {
  '是': 1,
  '否': 2
};
const marriage = {
  '未婚': '1',
  '已婚': '2',
  '离异': '3'
};
const env = {
  '测试环境': 'test',
  '本地环境': 'local',
  '开发环境': 'dev',
  '生产环境': 'prod'
};
const toColumns = function (value, obj) {
  for (let item in obj) {
    if (value == obj[item]) {
      return item
    }
  }
};
export {sex, station, nation, marriage, toColumns, label, env, boolean}

